#include <stdio.h>
#include <stdlib.h> 
#define M 5
#define N 10

int main() { 
    system("chcp 65001");
    float array[M][N]= {
        1.2, 27.7, 3.1, -9.0, 4.4, 58.3, 0.6, 6.1, 2.5, -15.9,
        -2.1, 3.3, -6.1, 9.0, -5.1, 10.7, 18.8, 7.6, 4.7, 1.6,
        5.5, 0.6, 43.4, -7.9, 1.2, 8.0, -22.8, 9.7, 56.3, -4.1,
        83.0, -6.0, 14.6, 1.3, -29.2, 7.1, -2.6, 0.9, 5.3, 81.0,
        4.3, -12.7, 8.1, -1.5, 9.9, -80.4, 3.6, -6.8, 7.2, -15.5 
    };

    int i, j;
    float min;
    
    puts("Мінімальні значення в кожному рядку: ");
    for(i=0; i<M; i+=1){
        min = array[i][0];
        for(j=1; j<N; j+=1){
            if(min > array[i][j]){
                min = array[i][j];
            }
        }
        printf("%.1f\n", min);
    }

    return 0;
}